ТОИР_демо/src/InformationRegisters/торо_ЗаказыНаРемонтВЕРП/торо_ЗаказыНаРемонтВЕРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаказыНаРемонтВЕРП</name>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьАкт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачальныйДокумент</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполненияРемонта</name>
    <type>
      <types>EnumRef.торо_СпособыВыполненияРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_СпособыВыполненияРемонтов/торо_СпособыВыполненияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СпособыВыполненияРемонтов</name>
  <enumValues>
    <name>Подрядный</name>
  </enumValues>
  <enumValues>
    <name>РемонтирующееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ЭксплуатирующееПодразделение</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклад</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/InformationRegisters/торо_ЗаказыНаРемонтВЕРП/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура АктуализироватьЗаписиРегистра_ОЛД(Регистратор) Экспорт
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_Ремонты.ID КАК ID
		|ПОМЕСТИТЬ СписокID
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|ГДЕ
		|	торо_Ремонты.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_Ремонты.Период КАК Период,
		|	торо_Ремонты.Регистратор КАК Регистратор,
		|	торо_Ремонты.ID КАК ID,
		|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_Ремонты.ВидРемонта КАК ВидРемонта,
		|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|	торо_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт
		|ПОМЕСТИТЬ ВсеЗаписиПоРемонтам
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|ГДЕ
		|	торо_Ремонты.ID В
		|			(ВЫБРАТЬ
		|				СписокID.ID
		|			ИЗ
		|				СписокID КАК СписокID)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот
		|ПОМЕСТИТЬ ПредварительнаяТаблицаСПланами
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					СписокID.ID
		|				ИЗ
		|					СписокID КАК СписокID)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|ГДЕ
		|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительнаяТаблицаСПланами.Период КАК Период,
		|	ПредварительнаяТаблицаСПланами.Регистратор КАК Регистратор,
		|	ПредварительнаяТаблицаСПланами.ID КАК ID,
		|	ПредварительнаяТаблицаСПланами.ОбъектРемонтныхРабот КАК ОбъектРемонта,
		|	ПредварительнаяТаблицаСПланами.ВидРемонтныхРабот КАК ВидРемонта,
		|	ПредварительнаяТаблицаСПланами.ДатаНачалаРемонтныхРабот КАК ДатаНачалаПлан,
		|	ПредварительнаяТаблицаСПланами.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияПлан,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаФакт,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончанияФакт
		|ПОМЕСТИТЬ ВТИсходныеДокументы
		|ИЗ
		|	ПредварительнаяТаблицаСПланами КАК ПредварительнаяТаблицаСПланами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПредварительнаяТаблицаСПланами.ID КАК ID,
		|			МАКСИМУМ(ПредварительнаяТаблицаСПланами.Период) КАК Период
		|		ИЗ
		|			ПредварительнаяТаблицаСПланами КАК ПредварительнаяТаблицаСПланами
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПредварительнаяТаблицаСПланами.ID) КАК ВложенныйЗапрос
		|		ПО ПредварительнаяТаблицаСПланами.ID = ВложенныйЗапрос.ID
		|			И ПредварительнаяТаблицаСПланами.Период = ВложенныйЗапрос.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ВыявленныеДефекты.Период,
		|	ВсеЗаписиПоРемонтам.Регистратор,
		|	торо_ВыявленныеДефекты.ID,
		|	ВсеЗаписиПоРемонтам.ОбъектРемонта,
		|	ВсеЗаписиПоРемонтам.ВидРемонта,
		|	ВЫБОР
		|		КОГДА ВсеЗаписиПоРемонтам.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА торо_ВыявленныеДефекты.Период
		|		ИНАЧЕ ВсеЗаписиПоРемонтам.ДатаНачалаПлан
		|	КОНЕЦ,
		|	ВсеЗаписиПоРемонтам.ДатаОкончанияПлан,
		|	ВсеЗаписиПоРемонтам.ДатаНачалаФакт,
		|	ВсеЗаписиПоРемонтам.ДатаОкончанияФакт
		|ИЗ
		|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
		|		ПО торо_ВыявленныеДефекты.Регистратор = ВсеЗаписиПоРемонтам.Регистратор
		|			И торо_ВыявленныеДефекты.ID = ВсеЗаписиПоРемонтам.ID
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ВнешниеОснованияДляРабот.Период,
		|	торо_ВнешниеОснованияДляРабот.Регистратор,
		|	торо_ВнешниеОснованияДляРабот.ID,
		|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта,
		|	NULL,
		|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1)
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
		|		ПО торо_ВнешниеОснованияДляРабот.Регистратор = ВсеЗаписиПоРемонтам.Регистратор
		|			И торо_ВнешниеОснованияДляРабот.ID = ВсеЗаписиПоРемонтам.ID
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(торо_ВнешниеОснованияДляРабот.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсходныеДокументы.Регистратор КАК НачальныйДокумент,
		|	ВТИсходныеДокументы.ID КАК УникальныйИдентификатор,
		|	ВТИсходныеДокументы.ОбъектРемонта КАК ОбъектЭксплуатации,
		|	ВТИсходныеДокументы.ВидРемонта КАК ВидРемонта,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		|				ТОГДА ВсеЗаписиПоРемонтам.ДатаНачалаПлан
		|			ИНАЧЕ ВТИсходныеДокументы.ДатаНачалаПлан
		|		КОНЕЦ) КАК ДатаНачалаПлан,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		|				ТОГДА ВсеЗаписиПоРемонтам.ДатаОкончанияПлан
		|			ИНАЧЕ ВТИсходныеДокументы.ДатаОкончанияПлан
		|		КОНЕЦ) КАК ДатаОкончанияПлан,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ВТИсходныеДокументы.ДатаНачалаФакт
		|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.ДатаНачала
		|	КОНЕЦ КАК ДатаНачалаФакт,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ВТИсходныеДокументы.ДатаОкончанияФакт
		|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияФакт,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Заявки,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Наряды,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Завершен
		|ПОМЕСТИТЬ ПредварительнаяТаблицаСИтогами
		|ИЗ
		|	ВТИсходныеДокументы КАК ВТИсходныеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО ВТИсходныеДокументы.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
		|		ПО ВТИсходныеДокументы.ID = ВсеЗаписиПоРемонтам.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсходныеДокументы.Регистратор,
		|	ВТИсходныеДокументы.ID,
		|	ВТИсходныеДокументы.ОбъектРемонта,
		|	ВТИсходныеДокументы.ВидРемонта,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ВТИсходныеДокументы.ДатаНачалаФакт
		|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.ДатаНачала
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ВТИсходныеДокументы.ДатаОкончанияФакт
		|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительнаяТаблицаСИтогами.НачальныйДокумент КАК НачальныйДокумент,
		|	ПредварительнаяТаблицаСИтогами.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	ПредварительнаяТаблицаСИтогами.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
		|	ПредварительнаяТаблицаСИтогами.ВидРемонта КАК ВидРемонта,
		|	ПредварительнаяТаблицаСИтогами.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	ПредварительнаяТаблицаСИтогами.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|	ВЫБОР
		|		КОГДА НЕ ПредварительнаяТаблицаСИтогами.Завершен
		|			ТОГДА ВсеЗаписиПоРемонтам.ДатаНачалаФакт
		|		ИНАЧЕ ПредварительнаяТаблицаСИтогами.ДатаНачалаФакт
		|	КОНЕЦ КАК ДатаНачалаФакт,
		|	ВЫБОР
		|		КОГДА НЕ ПредварительнаяТаблицаСИтогами.Завершен
		|			ТОГДА ВсеЗаписиПоРемонтам.ДатаОкончанияФакт
		|		ИНАЧЕ ПредварительнаяТаблицаСИтогами.ДатаОкончанияФакт
		|	КОНЕЦ КАК ДатаОкончанияФакт,
		|	ВЫБОР
		|		КОГДА ПредварительнаяТаблицаСИтогами.Заявки > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА ПредварительнаяТаблицаСИтогами.Наряды > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьНаряд,
		|	ПредварительнаяТаблицаСИтогами.Завершен КАК Завершен
		|ИЗ
		|	ПредварительнаяТаблицаСИтогами КАК ПредварительнаяТаблицаСИтогами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
		|		ПО (НЕ ПредварительнаяТаблицаСИтогами.Завершен)
		|			И (ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот))
		|			И ПредварительнаяТаблицаСИтогами.УникальныйИдентификатор = ВсеЗаписиПоРемонтам.ID";
		
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.торо_ЗаказыНаРемонтВЕРП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.УникальныйИдентификатор = ВыборкаДетальныеЗаписи.УникальныйИдентификатор; 
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСпособРемонта(СтрокаТЧ, ЭтоОтменаПроведения, Регистратор)
	
	ТекДок = ?(ЭтоОтменаПроведения, СтрокаТЧ.НачальныйДокумент, Регистратор.ссылка);
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		Запрос.Текст = "ВЫБРАТЬ
           |	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.ID,
           |	ВЫБОР
           |		КОГДА торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Исполнитель = торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.ОбъектРемонта.Подразделение
           |				ИЛИ торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Исполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.РемонтирующееПодразделение)
           |	КОНЕЦ КАК СпособВыполненияРемонта
           |ИЗ
           |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботРемонтныеРаботы
           |ГДЕ
           |	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка = &Ссылка
		   |	И торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.ID = &ID";
					   
	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
						   
		Запрос.Текст = "ВЫБРАТЬ
           |	тзРемонтыОборудования.ID КАК ID,
           |	МАКСИМУМ(ВЫБОР
           |			КОГДА тзПодрядчики.ID ЕСТЬ NULL 
           |				ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.Подрядный)
           |		КОНЕЦ) КАК СпособВыполненияРемонта
           |ИЗ
           |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК тзРемонтыОборудования
           |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Подрядчики КАК тзПодрядчики
           |		ПО тзРемонтыОборудования.Ссылка = тзПодрядчики.Ссылка
           |			И тзРемонтыОборудования.ID = тзПодрядчики.РемонтыОборудования_ID
           |ГДЕ
           |	тзРемонтыОборудования.Ссылка = &Ссылка
           |	И тзРемонтыОборудования.ID = &ID
           |
           |СГРУППИРОВАТЬ ПО
           |	тзРемонтыОборудования.ID";
					   
	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
           |	тзРемонтыОборудования.ID КАК ID,
           |	МАКСИМУМ(ВЫБОР
           |			КОГДА тзПодрядчики.ID ЕСТЬ NULL 
           |				ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.Подрядный)
           |		КОНЕЦ) КАК СпособВыполненияРемонта
           |ИЗ
           |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК тзРемонтыОборудования
           |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ПодрядчикиРемонтныхРабот КАК тзПодрядчики
           |		ПО тзРемонтыОборудования.Ссылка = тзПодрядчики.Ссылка
           |			И тзРемонтыОборудования.ID = тзПодрядчики.РемонтыОборудования_ID
           |ГДЕ
           |	тзРемонтыОборудования.Ссылка = &Ссылка
           |	И тзРемонтыОборудования.ID = &ID
           |
           |СГРУППИРОВАТЬ ПО
           |	тзРемонтыОборудования.ID";
		
	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
           |	торо_Ремонты.ID КАК ID,
           |	торо_Ремонты.Регистратор КАК Ссылка
           |ПОМЕСТИТЬ рсРемонты
           |ИЗ
           |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
           |ГДЕ
           |	торо_Ремонты.Регистратор = &Ссылка
           |	И торо_Ремонты.ID = &ID
           |
           |ИНДЕКСИРОВАТЬ ПО
           |	ID,
           |	торо_Ремонты.Регистратор
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	тзПланРемонтов.ID КАК ID,
           |	тзПланРемонтов.Ссылка КАК Ссылка,
           |	ВЫБОР
           |		КОГДА тзПланРемонтов.Исполнитель ССЫЛКА Справочник.Контрагенты
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.Подрядный)
           |		КОГДА тзПланРемонтов.Исполнитель = тзПланРемонтов.ОбъектРемонтныхРабот.Подразделение
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.РемонтирующееПодразделение)
           |	КОНЕЦ КАК СпособВыполненияРемонта
           |ПОМЕСТИТЬ тзПланРемонтов
           |ИЗ
           |	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК тзПланРемонтов
           |ГДЕ
           |	тзПланРемонтов.Ссылка = &Ссылка
           |	И тзПланРемонтов.ID = &ID
           |
           |ИНДЕКСИРОВАТЬ ПО
           |	Ссылка,
           |	ID
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	тзПланРемонтов.ID,
           |	тзПланРемонтов.СпособВыполненияРемонта
           |ИЗ
           |	рсРемонты КАК рсРемонты
           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тзПланРемонтов КАК тзПланРемонтов
           |		ПО рсРемонты.Ссылка = тзПланРемонтов.Ссылка
           |			И рсРемонты.ID = тзПланРемонтов.ID";
					   
	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
					   
		Запрос.Текст = "ВЫБРАТЬ
           |	тзСписокДефектов.ID КАК ID,
           |	ВЫБОР
           |		КОГДА тзСписокДефектов.ПодразделениеИсполнитель = тзСписокДефектов.ОтказавшийЭлемент.Подразделение
           |				ИЛИ тзСписокДефектов.ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.РемонтирующееПодразделение)
           |	КОНЕЦ КАК СпособВыполненияРемонта
           |ИЗ
           |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК тзСписокДефектов
           |ГДЕ
           |	тзСписокДефектов.Ссылка = &Ссылка
           |	И тзСписокДефектов.ID = &ID";
		
	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
           |	тзРемонтыОборудования.ID КАК ID,
           |	МАКСИМУМ(ВЫБОР
           |			КОГДА тзИсполнители.Исполнитель ЕСТЬ NULL 
           |				ТОГДА 1
           |			КОГДА тзИсполнители.Исполнитель ССЫЛКА Справочник.Контрагенты
           |				ТОГДА 3
           |			КОГДА тзИсполнители.Исполнитель = тзРемонтыОборудования.ОбъектРемонта.Подразделение
           |					ИЛИ тзИсполнители.Исполнитель ССЫЛКА Справочник.Сотрудники
           |				ТОГДА 1
           |			ИНАЧЕ 2
           |		КОНЕЦ) КАК Исполнитель
           |ПОМЕСТИТЬ Данные
           |ИЗ
           |	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК тзРемонтыОборудования
           |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиРемонтныхРабот КАК тзИсполнители
           |		ПО тзРемонтыОборудования.Ссылка = тзИсполнители.Ссылка
           |			И тзРемонтыОборудования.ID = тзИсполнители.РемонтыОборудования_ID
           |ГДЕ
           |	тзРемонтыОборудования.Ссылка = &Ссылка
           |	И тзРемонтыОборудования.ID = &ID
           |
           |СГРУППИРОВАТЬ ПО
           |	тзРемонтыОборудования.ID
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	Таб.ID,
           |	ВЫБОР
           |		КОГДА Таб.Исполнитель = 3
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.Подрядный)
           |		КОГДА Таб.Исполнитель = 2
           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.РемонтирующееПодразделение)
           |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СпособыВыполненияРемонтов.ЭксплуатирующееПодразделение)
           |	КОНЕЦ КАК СпособВыполненияРемонта
           |ИЗ
           |	Данные КАК Таб";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ТекДок);
	Запрос.УстановитьПараметр("ID", СтрокаТЧ.УникальныйИдентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СпособВыполненияРемонта;
	
КонецФункции

Процедура АктуализироватьЗаписиРегистра(Регистратор, ЭтоОтменаПроведения = Ложь, ТабИД = Неопределено) Экспорт
	
	Таблица_ID = Неопределено; 
	
	Если ТабИД <> Неопределено Тогда
		Таблица_ID = ТабИД;
	Иначе
		Регистратор.ДополнительныеСвойства.Свойство("Таблица_ID", Таблица_ID);
		Если Таблица_ID = Неопределено Тогда
			Таблица_ID = Новый ТаблицаЗначений;
			Таблица_ID.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Параметры.Вставить("Таблица_ID", Таблица_ID);
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	Запрос.УстановитьПараметр("ЭтоОтменаПроведения", ЭтоОтменаПроведения);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица_ID.ID КАК ID
	               |ПОМЕСТИТЬ Таблица_ID
	               |ИЗ
	               |	&Таблица_ID КАК Таблица_ID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица_ID.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_ID
	               |ИЗ
	               |	Таблица_ID КАК Таблица_ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_Ремонты.ID
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |ГДЕ
	               |	торо_Ремонты.Регистратор = &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ID.ID КАК ID
	               |ПОМЕСТИТЬ СписокID
	               |ИЗ
	               |	ВТ_ID КАК ВТ_ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_Ремонты.Период КАК Период,
	               |	торо_Ремонты.Регистратор КАК Регистратор,
	               |	торо_Ремонты.ID КАК ID,
	               |	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	               |	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	               |	торо_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт
	               |ПОМЕСТИТЬ ВсеЗаписиПоРемонтам_вт
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |ГДЕ
	               |	торо_Ремонты.ID В
	               |			(ВЫБРАТЬ
	               |				СписокID.ID
	               |			ИЗ
	               |				СписокID КАК СписокID)
	               |	И НЕ(&ЭтоОтменаПроведения
	               |				И торо_Ремонты.Регистратор = &Регистратор)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб.ID,
	               |	МИНИМУМ(Таб.ДатаНачалаПлан) КАК ДатаНачалаПлан
	               |ПОМЕСТИТЬ ДатыСвернуто
	               |ИЗ
	               |	ВсеЗаписиПоРемонтам_вт КАК Таб
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(Таб.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_Ремонты.Период КАК Период,
	               |	торо_Ремонты.Регистратор КАК Регистратор,
	               |	торо_Ремонты.ID КАК ID,
	               |	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	               |	ЕСТЬNULL(ДатыСвернуто.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан,
	               |	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	               |	торо_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт
	               |ПОМЕСТИТЬ ВсеЗаписиПоРемонтам
	               |ИЗ
	               |	ВсеЗаписиПоРемонтам_вт КАК торо_Ремонты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыСвернуто КАК ДатыСвернуто
	               |		ПО торо_Ремонты.ID = ДатыСвернуто.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот
	               |ПОМЕСТИТЬ ПредварительнаяТаблицаСПланами
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	               |			,
	               |			ID В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						ВсеЗаписиПоРемонтам.ID
	               |					ИЗ
	               |						ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам)
	               |				И НЕ(&ЭтоОтменаПроведения
	               |						И Регистратор = &Регистратор)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |ГДЕ
	               |	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительнаяТаблицаСПланами.ID КАК ID,
	               |	МАКСИМУМ(ПредварительнаяТаблицаСПланами.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_ПланМаксимальныеПериоды
	               |ИЗ
	               |	ПредварительнаяТаблицаСПланами КАК ПредварительнаяТаблицаСПланами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредварительнаяТаблицаСПланами.ID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	2 КАК приоритет,
	               |	ПредварительнаяТаблицаСПланами.Период КАК Период,
	               |	ПредварительнаяТаблицаСПланами.Регистратор КАК Регистратор,
	               |	ПредварительнаяТаблицаСПланами.ID КАК ID,
	               |	ПредварительнаяТаблицаСПланами.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	ПредварительнаяТаблицаСПланами.ВидРемонтныхРабот КАК ВидРемонта,
	               |	ПредварительнаяТаблицаСПланами.ДатаНачалаРемонтныхРабот КАК ДатаНачалаПлан,
	               |	ПредварительнаяТаблицаСПланами.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияПлан,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаФакт,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончанияФакт
	               |ПОМЕСТИТЬ ВТИсходныеДокументы
	               |ИЗ
	               |	ПредварительнаяТаблицаСПланами КАК ПредварительнаяТаблицаСПланами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПланМаксимальныеПериоды КАК ВТ_ПланМаксимальныеПериоды
	               |		ПО ПредварительнаяТаблицаСПланами.ID = ВТ_ПланМаксимальныеПериоды.ID
	               |			И ПредварительнаяТаблицаСПланами.Период = ВТ_ПланМаксимальныеПериоды.Период
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1,
	               |	торо_ВыявленныеДефекты.Период,
	               |	ВсеЗаписиПоРемонтам.Регистратор,
	               |	торо_ВыявленныеДефекты.ID,
	               |	ВсеЗаписиПоРемонтам.ОбъектРемонта,
	               |	ВсеЗаписиПоРемонтам.ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА ВсеЗаписиПоРемонтам.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА торо_ВыявленныеДефекты.Период
	               |		ИНАЧЕ ВсеЗаписиПоРемонтам.ДатаНачалаПлан
	               |	КОНЕЦ,
	               |	ВсеЗаписиПоРемонтам.ДатаОкончанияПлан,
	               |	ВсеЗаписиПоРемонтам.ДатаНачалаФакт,
	               |	ВсеЗаписиПоРемонтам.ДатаОкончанияФакт
	               |ИЗ
	               |	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
	               |		ПО торо_ВыявленныеДефекты.Регистратор = ВсеЗаписиПоРемонтам.Регистратор
	               |			И торо_ВыявленныеДефекты.ID = ВсеЗаписиПоРемонтам.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	торо_ВнешниеОснованияДляРабот.Период,
	               |	торо_ВнешниеОснованияДляРабот.Регистратор,
	               |	торо_ВнешниеОснованияДляРабот.ID,
	               |	торо_ВнешниеОснованияДляРабот.ОбъектРемонта,
	               |	NULL,
	               |	ВЫБОР
	               |		КОГДА ВсеЗаписиПоРемонтам.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта
	               |		ИНАЧЕ ВсеЗаписиПоРемонтам.ДатаНачалаПлан
	               |	КОНЕЦ,
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	ДАТАВРЕМЯ(1, 1, 1)
	               |ИЗ
	               |	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
	               |		ПО торо_ВнешниеОснованияДляРабот.Регистратор = ВсеЗаписиПоРемонтам.Регистратор
	               |			И торо_ВнешниеОснованияДляРабот.ID = ВсеЗаписиПоРемонтам.ID
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(торо_ВнешниеОснованияДляРабот.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ЗавершенныеРемонтныеРаботы.ID КАК ID,
	               |	торо_ЗавершенныеРемонтныеРаботы.ДатаНачала,
	               |	торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания,
	               |	торо_ЗавершенныеРемонтныеРаботы.Регистратор
	               |ПОМЕСТИТЬ ВТ_ЗавершенныеРаботы
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	               |ГДЕ
	               |	торо_ЗавершенныеРемонтныеРаботы.ID В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ВТИсходныеДокументы.ID
	               |			ИЗ
	               |				ВТИсходныеДокументы КАК ВТИсходныеДокументы)
	               |	И НЕ(&ЭтоОтменаПроведения
	               |				И торо_ЗавершенныеРемонтныеРаботы.Регистратор = &Регистратор)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИсходныеДокументы.приоритет,
	               |	ВТИсходныеДокументы.Регистратор КАК НачальныйДокумент,
	               |	ВТИсходныеДокументы.ID КАК УникальныйИдентификатор,
	               |	ВТИсходныеДокументы.ОбъектРемонта КАК ОбъектЭксплуатации,
	               |	ВТИсходныеДокументы.ВидРемонта КАК ВидРемонта,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |				ТОГДА ВсеЗаписиПоРемонтам.ДатаНачалаПлан
	               |			ИНАЧЕ ВТИсходныеДокументы.ДатаНачалаПлан
	               |		КОНЕЦ) КАК ДатаНачалаПлан,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |				ТОГДА ВсеЗаписиПоРемонтам.ДатаОкончанияПлан
	               |			ИНАЧЕ ВТИсходныеДокументы.ДатаОкончанияПлан
	               |		КОНЕЦ) КАК ДатаОкончанияПлан,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ВТИсходныеДокументы.ДатаНачалаФакт
	               |		ИНАЧЕ ВТ_ЗавершенныеРаботы.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачалаФакт,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ВТИсходныеДокументы.ДатаОкончанияФакт
	               |		ИНАЧЕ ВТ_ЗавершенныеРаботы.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончанияФакт,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Заявки,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Наряды,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Акты,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Завершен
	               |ПОМЕСТИТЬ ПредварительнаяТаблицаСИтогами
	               |ИЗ
	               |	ВТИсходныеДокументы КАК ВТИсходныеДокументы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенныеРаботы КАК ВТ_ЗавершенныеРаботы
	               |		ПО ВТИсходныеДокументы.ID = ВТ_ЗавершенныеРаботы.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
	               |		ПО ВТИсходныеДокументы.ID = ВсеЗаписиПоРемонтам.ID
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТИсходныеДокументы.приоритет,
	               |	ВТИсходныеДокументы.Регистратор,
	               |	ВТИсходныеДокументы.ID,
	               |	ВТИсходныеДокументы.ОбъектРемонта,
	               |	ВТИсходныеДокументы.ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ВТИсходныеДокументы.ДатаНачалаФакт
	               |		ИНАЧЕ ВТ_ЗавершенныеРаботы.ДатаНачала
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ВТИсходныеДокументы.ДатаОкончанияФакт
	               |		ИНАЧЕ ВТ_ЗавершенныеРаботы.ДатаОкончания
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗавершенныеРаботы.Регистратор ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительнаяТаблицаСИтогами.приоритет,
	               |	ПредварительнаяТаблицаСИтогами.НачальныйДокумент КАК НачальныйДокумент,
	               |	ПредварительнаяТаблицаСИтогами.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	ПредварительнаяТаблицаСИтогами.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	               |	ПредварительнаяТаблицаСИтогами.ВидРемонта КАК ВидРемонта,
	               |	ПредварительнаяТаблицаСИтогами.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	ПредварительнаяТаблицаСИтогами.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	ВЫБОР
	               |		КОГДА НЕ ПредварительнаяТаблицаСИтогами.Завершен
	               |			ТОГДА ВсеЗаписиПоРемонтам.ДатаНачалаФакт
	               |		ИНАЧЕ ПредварительнаяТаблицаСИтогами.ДатаНачалаФакт
	               |	КОНЕЦ КАК ДатаНачалаФакт,
	               |	ВЫБОР
	               |		КОГДА НЕ ПредварительнаяТаблицаСИтогами.Завершен
	               |			ТОГДА ВсеЗаписиПоРемонтам.ДатаОкончанияФакт
	               |		ИНАЧЕ ПредварительнаяТаблицаСИтогами.ДатаОкончанияФакт
	               |	КОНЕЦ КАК ДатаОкончанияФакт,
	               |	ВЫБОР
	               |		КОГДА ПредварительнаяТаблицаСИтогами.Заявки > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьЗаявка,
	               |	ВЫБОР
	               |		КОГДА ПредварительнаяТаблицаСИтогами.Наряды > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьНаряд,
	               |	ВЫБОР
	               |		КОГДА ПредварительнаяТаблицаСИтогами.Акты > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьАкт,
	               |	ПредварительнаяТаблицаСИтогами.Завершен КАК Завершен
	               |ПОМЕСТИТЬ ВТ_Базовая
	               |ИЗ
	               |	ПредварительнаяТаблицаСИтогами КАК ПредварительнаяТаблицаСИтогами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЗаписиПоРемонтам КАК ВсеЗаписиПоРемонтам
	               |		ПО (НЕ ПредварительнаяТаблицаСИтогами.Завершен)
	               |			И (ТИПЗНАЧЕНИЯ(ВсеЗаписиПоРемонтам.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот))
	               |			И ПредварительнаяТаблицаСИтогами.УникальныйИдентификатор = ВсеЗаписиПоРемонтам.ID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	УникальныйИдентификатор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписокID.ID,
	               |	ЕСТЬNULL(ВТ_Базовая.приоритет, 0) КАК Приоритет,
	               |	ЕСТЬNULL(ВТ_Базовая.НачальныйДокумент, &Регистратор) КАК НачальныйДокумент,
	               |	ЕСТЬNULL(ВТ_Базовая.УникальныйИдентификатор, СписокID.ID) КАК УникальныйИдентификатор,
	               |	ВТ_Базовая.ОбъектЭксплуатации,
	               |	ВТ_Базовая.ВидРемонта,
	               |	ВТ_Базовая.ДатаНачалаПлан,
	               |	ВТ_Базовая.ДатаОкончанияПлан,
	               |	ВТ_Базовая.ДатаНачалаФакт,
	               |	ВТ_Базовая.ДатаОкончанияФакт,
	               |	ВТ_Базовая.ЕстьЗаявка,
	               |	ВТ_Базовая.ЕстьНаряд,
	               |	ВТ_Базовая.ЕстьАкт,
	               |	ВТ_Базовая.Завершен,
	               |	ВЫБОР
	               |		КОГДА ВТ_Базовая.УникальныйИдентификатор ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Удален
	               |ПОМЕСТИТЬ Финальная
	               |ИЗ
	               |	СписокID КАК СписокID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Базовая КАК ВТ_Базовая
	               |		ПО СписокID.ID = ВТ_Базовая.УникальныйИдентификатор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_РемонтыСрезПоследних.ID КАК ID,
	               |	МАКСИМУМ(торо_РемонтыСрезПоследних.Период) КАК Период
	               |ПОМЕСТИТЬ НедостающиеВР_МаксДата
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты.СрезПоследних(
	               |			,
	               |			ID В
	               |					(ВЫБРАТЬ
	               |						Таб.ID
	               |					ИЗ
	               |						ВТ_ID КАК Таб)
	               |				И НЕ(&ЭтоОтменаПроведения
	               |						И Регистратор = &Регистратор)) КАК торо_РемонтыСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_РемонтыСрезПоследних.ID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_Ремонты.ID,
	               |	торо_Ремонты.ВидРемонта,
	               |	торо_Ремонты.ДатаНачалаФакт,
	               |	торо_Ремонты.ДатаОкончанияФакт
	               |ПОМЕСТИТЬ НедостающиеВР
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НедостающиеВР_МаксДата КАК НедостающиеВР_МаксДата
	               |		ПО торо_Ремонты.ID = НедостающиеВР_МаксДата.ID
	               |			И торо_Ремонты.Период = НедостающиеВР_МаксДата.Период
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	торо_Ремонты.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб.ID КАК ID,
	               |	Таб.Приоритет КАК Приоритет,
	               |	Таб.НачальныйДокумент КАК НачальныйДокумент,
	               |	Таб.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	Таб.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	               |	ЕСТЬNULL(Таб.ВидРемонта, НедостающиеВР.ВидРемонта) КАК ВидРемонта,
	               |	Таб.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	Таб.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	НедостающиеВР.ДатаНачалаФакт КАК ДатаНачалаФакт,
	               |	НедостающиеВР.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	               |	Таб.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	Таб.ЕстьНаряд КАК ЕстьНаряд,
	               |	Таб.ЕстьАкт КАК ЕстьАкт,
	               |	Таб.Завершен КАК Завершен,
	               |	Таб.Удален КАК Удален
	               |ПОМЕСТИТЬ Финальная1
	               |ИЗ
	               |	Финальная КАК Таб
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НедостающиеВР КАК НедостающиеВР
	               |		ПО Таб.ID = НедостающиеВР.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб.ID,
	               |	Таб.Приоритет,
	               |	Таб.НачальныйДокумент,
	               |	Таб.УникальныйИдентификатор,
	               |	Таб.ОбъектЭксплуатации,
	               |	Таб.ВидРемонта,
	               |	Таб.ДатаНачалаПлан,
	               |	Таб.ДатаОкончанияПлан,
	               |	Таб.ДатаНачалаФакт,
	               |	Таб.ДатаОкончанияФакт,
	               |	Таб.ЕстьЗаявка,
	               |	Таб.ЕстьНаряд,
	               |	Таб.ЕстьАкт,
	               |	Таб.Завершен,
	               |	Таб.Удален
	               |ИЗ
	               |	Финальная1 КАК Таб";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() И ЭтоОтменаПроведения = Истина Тогда
		Для Каждого СтрокаТЗ Из Таблица_ID Цикл
			МенеджерЗаписи = РегистрыСведений.торо_ЗаказыНаРемонтВЕРП.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УникальныйИдентификатор = СтрокаТЗ.ID;
			//МенеджерЗаписи.НачальныйДокумент = Регистратор.Ссылка;
			МенеджерЗаписи.Удален = Истина;
			МенеджерЗаписи.Записать();
		КонецЦикла; 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.ID,
	               |	Таб.Приоритет КАК Приоритет,
	               |	ВЫБОР
	               |		КОГДА Таб.Удален
	               |			ТОГДА ЗНАЧЕНИЕ(Документ.торо_ВыявленныеДефекты.ПустаяСсылка)
	               |		ИНАЧЕ Таб.НачальныйДокумент
	               |	КОНЕЦ КАК НачальныйДокумент,
	               |	Таб.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	Таб.ОбъектЭксплуатации,
	               |	Таб.ВидРемонта,
	               |	Таб.ДатаНачалаПлан,
	               |	Таб.ДатаОкончанияПлан,
	               |	Таб.ДатаНачалаФакт,
	               |	Таб.ДатаОкончанияФакт,
	               |	Таб.ЕстьЗаявка,
	               |	Таб.ЕстьНаряд,
	               |	Таб.ЕстьАкт,
	               |	Таб.Завершен,
	               |	Таб.Удален
	               |ИЗ
	               |	Финальная1 КАК Таб
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет УБЫВ
	               |ИТОГИ ПО
	               |	УникальныйИдентификатор";
				   
	
	ВыборкаПоУИ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоУИ.Следующий() Цикл
		
		ДетЗаписи = ВыборкаПоУИ.Выбрать();
		ДетЗаписи.Следующий();
		
		МенеджерЗаписи = РегистрыСведений.торо_ЗаказыНаРемонтВЕРП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДетЗаписи);
		МенеджерЗаписи.СпособВыполненияРемонта = ПолучитьСпособРемонта(ДетЗаписи, ЭтоОтменаПроведения, Регистратор);
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
